tutorials/incompressible/icoDyMFoam/mixerGgi/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    impellerWall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    baffleWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    insideSlider
    {
        type            ggi;
        value           uniform (0 0 0);
    }
    outsideSlider
    {
        type            ggi;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
